Revit 2027 API
ExternallyTaggedNonBRep Class
 This class is used to create an externally tagged geometry object.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ExternallyTaggedGeometryObject
 Autodesk.Revit.DB.ExternallyTaggedNonBRep
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ExternallyTaggedNonBRep : ExternallyTaggedGeometryObject
Public Class ExternallyTaggedNonBRep
	Inherits ExternallyTaggedGeometryObject
public ref class ExternallyTaggedNonBRep : public ExternallyTaggedGeometryObject
type ExternallyTaggedNonBRep =
    class
        inherit ExternallyTaggedGeometryObject
    end
The ExternallyTaggedNonBRep type exposes the following members.
Constructors
Name | Description
ExternallyTaggedNonBRep |  Constructs an ExternallyTaggedGeometryObject associating a given ExternalGeometryId with a particular GeometryObject.
Top
Properties
Name | Description
ExternalId |  The external Id of the geometry object.
(Inherited from ExternallyTaggedGeometryObject)
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from ExternallyTaggedGeometryObject)
Top
Methods
Name | Description
Dispose
(Inherited from ExternallyTaggedGeometryObject)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
SetUsage |  Controls the usage of this ExternallyTaggedNonBRep.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.DB Namespace